# coding=UTF-8


class FreqAttack:
	def __init__(self, alphabet, alphabet_frequency):
		self.alphabet = alphabet
		self.alphabet_frequency = alphabet_frequency
		self.cipher_frequency = []
		self.shaker = []
		self.temp2 = []

	def executeAttack(self, cipher_text):
		self.calculateCipherFreq(cipher_text=cipher_text)

		open_text = ''

		self.shakeLetters(alphabet_freq=alphabet_frequency, position=0)
		print(len(self.shaker))
		print(self.temp2)

		for char in cipher_text:
			open_text += self.alphabet_frequency[self.alphabet.index(char)]

		return open_text

	def shakeLetters(self, alphabet_freq, position):
		# print(alphabet_freq, position)
		if position < len(alphabet_freq):
			self.shaker.append(alphabet_freq)
			self.temp2.append(position)
			pointers = []
			for i in range(-2, 3, 1):
				if (position + i >= 0) and (position + i < len(alphabet_freq)):
					pointers.append(position + i)
			for p in pointers:
				temp = list(alphabet_freq)
				temp[position], temp[p] = temp[p], temp[position]
				self.shakeLetters(alphabet_freq=temp, position=position + 1)

	def calculateCipherFreq(self, cipher_text):
		for i in range(len(self.alphabet)):
			self.cipher_frequency.append(0)

		for char in cipher_text:
			self.cipher_frequency[self.alphabet.index(char)] += 1

		self.alphabet, self.cipher_frequency = (list(x) for x in zip(
			*sorted(zip(self.alphabet, self.cipher_frequency), key=lambda pair: -pair[1])))


cipher_text_1 = 'НОААЗДБЛЩХОЖЦБЫЦООМКЦЯПХКСЦЗЫЦЮХОПАОГККЖЦОРОМЗЛГКЦЦБЫХЮЦЯЙКМКЖДКЕКХЯОЦЗГЧАИДЖЗХЛЕОЩОЫЛДСЗКЗНОХОЙОСОШПКГЮЦЦЭЧШКЖГЧЛОПКХЪЮУЮИЛИСЕОХИПЩКЗДУЮДКГЯЦООАХЮАОДЮЦЦЮИШКЖГИСЛКГЯЛЩОЫЖКЛДЦОЛДЗЗНГЧАЗЖОКЖКЛДООЦЗЦКЕОЦЗЖЮЧДЗЦКГЧАИДЖЮЙЗЦБАОГККЛГОЪЦБКМКЖЩЭШЦКМЦБКЖКНЮСОПИЦЮИЖКГЯЦЗТЮЗГЗХЭМЦОЫДЩЮТЩЗЫЛДЮЦОЩНОДИОЦЗЗЛЩЭЛЦБСОАХЮУКЦЗЗЛЗЦЛДХЭЖКЦДЮЖЗПЮЪКСПХКСЦЗКСХКЖКЦЮОЦЗЩЮЩЕХЮСЗГОЛДОХОЦЗГЗЛЯСБЛОЩОРОЦЮХОПЮЩЮЩОЦЗЦЮШБСЮЧДЦЮЛЮДКЕКХЯОЦЗЗШАКРЮЧДЦЮЛЛОЛДХЮНОЖЗЗНЛДЮГОДХЭПЦООДБЛЩЮДЯЭЦЗНДОЦЩЗЫЛГЭНЗОЛДХОКШХКЦЗКЗНОДИОЦЗЛЩГОЦЦБЩЕОГЦОДКЗЦКДОХОЕИДЛИАКШЦКОАНОПЗЖОЛДЗДКЖЦКЖКЦККОЦЗЕХОСОХЦБЗГОСЩЗСПСЗЪКЦЗИНОЦЗОАГЮПЮЧДЭЖКЦЗКЖАБЛДХОЗЖОГМЮЛЩХБСЮДЯЛИЩОРПЮЦКЪКГЮЧДСЛДХКМЮДЯЛИЛЦКЭЩГЧЪКАХКПЭУЗЖМКГОСКЩОЖЗОЦЗХЮШСЗГЗФДОЭЖКЦЗКПОЛДКЕКЦЗЩОДОХЮИЖОЪКДЕОЩЮШЮДЯЛИГЧПИЖСОГЙКАЛДСОЖЦОЦЮЛЮЖОЖПКГКНОААЗДБЦЗЩОРПЮЦКШЮЦЗЖЮГЗЛЯСОГЙКАЛДСОЖЗЗНЦКЭГОСЗЖОЛДЯЛГКПЛДСЗКЗЛЩЭЛЛДСЮЭЦЮЛГКПОСЮЦЦОРОЗХЮШСЗДОРОЦЮЕХЮЩДЗЩКЛГКПЛДСЗКЗНПХЭЪАБЛЕХЗХОПОЫЩОДОХЮИОДЕГЮМЗСЮКДЗЖДЮЩЩЮЩЦКЖОРЭДЕХКПЛДЮСЗДЯЛКАКАОГЯЙЗКЗАОГККЦКЭЩГЧЪЗКХЮЛБ'
cipher_text_2 = 'ФЛОДЩВЖЫОЬГЖЭЗУИЖЯУВПБВРОИЩВГЫИБОЫЫИЪИДИЯУТРСДИГСПЯИЪДИХЫВХСГДТЯЫВХСДЬГТХСИЫГТГЪИБИДСУЯЮЫОЬХОЖБИПУСБЯТЖИЫСОКОХОЫООЬХОЖСНЫОЪИБВПУСУИОЯУЛФОДОАБВЕИАИХЯГТНТУЛШУИЫСЩЬАЛИЯИЩОЫЫИФДСЮУЫИОГДИХОУИЪИИЫЩВЖДТЯЯОЮЫБЯУТБТЮИЫБХОЯУИЯБИОПРЖЮФВНТЕБТУСЖУДОЬЪИЖЛЫЬЭРЖЮФЬЯЪОЫОДТЖЛЯГСХФЖЭХТЗОХСАОДЗТЖООАОДЪТЮЯЬЖУТЫАИУОЕФИДФИГТЪОЫОДТЖЫОФИФДИЯСЖБИНБДТУСУЛООЫИБЯЮОЪИДТЯЯОЮЫЫИЯУЛСЫОЬХОЫЛОБИПУСБЯТЖИЫСЪИБИДСУЛБЫОХБВГЬФТЖСЯЛБВДТЗОЫСОХАИЩДИАЬРСЮФДИЯУИУВСЯГДИХЫИЯУСТЫЫТФТБЖИБЫТФИБОДЫЬЖТЯЛГЫОХЬСЯЕДСЯУСТЫЯГИЭГДИУИЯУЛЭБВДТЗТЮФДИКОЫСОНТОЪИБВЕИАГЬГСБЫЬЖТОХЬСЯГТНТЖТ'
cipher_text_3 = 'ЛТЬНЩЭЦДЦЧЫЩЧДЦВЧСЙРЪАЪЮЫДЙНИЪЗКДРЦПСЫГДЩТПНВЪЬСЦСПУЕСВНИДВЦЫЩЧДЦЛНРЙТАДРЦТЩЭРНЯОСЙШСЦСЫЬНВОДКЪТЩЪВЦСЫВЫУВФЪАСГПТЮСЫТРЪДАЫСГЩТВЦЪОПЪЬЩТЙРСЕАТЦДАТЦЪЬЪЪЪРЛСПАТЦЪЬЪСГНХДРЪДРТЛТЬНЩЭЦДЦДСВНИДВЦЫЩЧДЦВЧЬТЬЫПТАЬТЗОДПЫСЕВЦНОДРЪЫУВФДШССГПТЮСЫТРЪЧЦТЬЪЫЦСПСЕАТШЪВЦПТЦНПТЫТВОЪПТРЦНПДЪЙСЬЦСПТРЦНПДЫДЙДЦВЧОСЙШСЦСЫЬТРТНХРУЗЪРТНХРСОДЙТШСШЪХДВЬЪЗПТГСЦРЪЬСЫЫУВФДЕЬЫТЩЪЛЪЬТКЪЪЬПСАДЦСШСРТЛТЬНЩЭЦДЦДВНИДВЦЫНДЦВЪВЦДАТОДПДОСЙШСЦСЫЬЪЬТЙПСЫЪОСЫУФДРЪЧЪАЪВЫСДЕОПСЛДВВЪСРТЩЭРСЕЬЫТЩЪЛЪЬТКЪЪЪВЪВЦДАТЙСЫНЮСЫВЬСЕОСЙШСЦСЫЬЪФЬСЩЭРЪЬСЫЫУОНВЬРЪЬЪЛТЬНЩЭЦДЦТОСЩНХТЯЦЬЫТЩЪЛЪЬТКЪЯЫВССЦЫДЦВЦЫЪЪВОПСЛЪЩДАВОДКЪТЩЭРСВЦЪОСЮЫСЩЧЯИНЯЪАЮТРЪАТЦЭВЧРТНХРСЪВВЩДЙСЫТЦДЩЭВЬСЕОПСГЩДАРСТРТЩЪЦЪХДВЬСЕЪСПШТРЪЮТКЪСРРСНОПТЫЩДРХДВЬСЕЙДЧЦДЩЭРСВЦЭЯРТОДПЫСАЪЫЦСПСАЬНПВТЗЙЩЧВЦНЙДРЦСЫЫВДЗВОДКЪТЩЭРСВЦДЕОПДОСЙТЯЦВЧГТЮСЫУДСГИДАТЦДАТЦЪХДВЬЪДЪСГИДОПСШПТААЪВЦВЬЪДЙЪВКЪОЩЪРУАТЦДАТЦЪХДВЬЪЕТРТЩЪЮШДСАДЦПЪЧЪТЩШДГПТЙЪЛЛДПДРКЪТЩЭРУДНПТЫРДРЪЧЙЪВЬПДЦРТЧАТЦДАТЦЪЬТЪАТЦДАТЦЪХДВЬТЧЩСШЪЬТОПСШПТААЪПСЫТРЪДСОДПТКЪСРРУДВЪВЦДАУВОДКЪТЩЪЮТКЪЧВЦНЙДРЦСЫЛТЬНЩЭЦДЦТОПЪЬЩТЙРСЕАТЦДАТЦЪЬЪЪЪРЛСПАТЦЪЬЪЫПТАЬТЗЪЮГПТРРСЕВОДКЪТЩЭРСВЦЪСВНИДВЦЫЩЧДЦВЧРТХЪРТЧВЦПДЦЭДШСЬНПВТСГНХДРЪЧ'
alphabet = list('АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ')

alphabet_frequency = list('ОЕАИНТСРВЛКМДПУЯЫЬГЗБЧЙХЖШЮЦЩЭФЪ')

print(cipher_text_3)
attack = FreqAttack(alphabet, alphabet_frequency)
print(attack.executeAttack(cipher_text_3))

# 1-ый Толкиен, война и мир, ФПМИ текст
