# coding=UTF-8


class FreqAttack:
	def __init__(self, alphabet, alphabet_frequency):
		self.alphabet = alphabet
		self.alphabet_frequency = alphabet_frequency
		self.cipher_frequency = []

	def executeAttack(self, cipher_text):
		for i in range(len(self.alphabet)):
			self.cipher_frequency.append(0)

		for char in cipher_text:
			self.cipher_frequency[self.alphabet.index(char)] += 1

		print('---------------', self.cipher_frequency, '------------------')

		self.alphabet, self.cipher_frequency = (list(x) for x in zip(
			*sorted(zip(self.alphabet, self.cipher_frequency), key=lambda pair: -pair[1])))

		open_text = ''

		for char in cipher_text:
			open_text += self.alphabet_frequency[self.alphabet.index(char)]

		return open_text


# cipher_text = 'НОААЗДБЛЩХОЖЦБЫЦООМКЦЯПХКСЦЗЫЦЮХОПАОГККЖЦОРОМЗЛГКЦЦБЫХЮЦЯЙКМКЖДКЕКХЯОЦЗГЧАИДЖЗХЛЕОЩОЫЛДСЗКЗНОХОЙОСОШПКГЮЦЦЭЧШКЖГЧЛОПКХЪЮУЮИЛИСЕОХИПЩКЗДУЮДКГЯЦООАХЮАОДЮЦЦЮИШКЖГИСЛКГЯЛЩОЫЖКЛДЦОЛДЗЗНГЧАЗЖОКЖКЛДООЦЗЦКЕОЦЗЖЮЧДЗЦКГЧАИДЖЮЙЗЦБАОГККЛГОЪЦБКМКЖЩЭШЦКМЦБКЖКНЮСОПИЦЮИЖКГЯЦЗТЮЗГЗХЭМЦОЫДЩЮТЩЗЫЛДЮЦОЩНОДИОЦЗЗЛЩЭЛЦБСОАХЮУКЦЗЗЛЗЦЛДХЭЖКЦДЮЖЗПЮЪКСПХКСЦЗКСХКЖКЦЮОЦЗЩЮЩЕХЮСЗГОЛДОХОЦЗГЗЛЯСБЛОЩОРОЦЮХОПЮЩЮЩОЦЗЦЮШБСЮЧДЦЮЛЮДКЕКХЯОЦЗЗШАКРЮЧДЦЮЛЛОЛДХЮНОЖЗЗНЛДЮГОДХЭПЦООДБЛЩЮДЯЭЦЗНДОЦЩЗЫЛГЭНЗОЛДХОКШХКЦЗКЗНОДИОЦЗЛЩГОЦЦБЩЕОГЦОДКЗЦКДОХОЕИДЛИАКШЦКОАНОПЗЖОЛДЗДКЖЦКЖКЦККОЦЗЕХОСОХЦБЗГОСЩЗСПСЗЪКЦЗИНОЦЗОАГЮПЮЧДЭЖКЦЗКЖАБЛДХОЗЖОГМЮЛЩХБСЮДЯЛИЩОРПЮЦКЪКГЮЧДСЛДХКМЮДЯЛИЛЦКЭЩГЧЪКАХКПЭУЗЖМКГОСКЩОЖЗОЦЗХЮШСЗГЗФДОЭЖКЦЗКПОЛДКЕКЦЗЩОДОХЮИЖОЪКДЕОЩЮШЮДЯЛИГЧПИЖСОГЙКАЛДСОЖЦОЦЮЛЮЖОЖПКГКНОААЗДБЦЗЩОРПЮЦКШЮЦЗЖЮГЗЛЯСОГЙКАЛДСОЖЗЗНЦКЭГОСЗЖОЛДЯЛГКПЛДСЗКЗЛЩЭЛЛДСЮЭЦЮЛГКПОСЮЦЦОРОЗХЮШСЗДОРОЦЮЕХЮЩДЗЩКЛГКПЛДСЗКЗНПХЭЪАБЛЕХЗХОПОЫЩОДОХЮИОДЕГЮМЗСЮКДЗЖДЮЩЩЮЩЦКЖОРЭДЕХКПЛДЮСЗДЯЛКАКАОГЯЙЗКЗАОГККЦКЭЩГЧЪЗКХЮЛБ'
cipher_text_2 = 'ФЛОДЩВЖЫОЬГЖЭЗУИЖЯУВПБВРОИЩВГЫИБОЫЫИЪИДИЯУТРСДИГСПЯИЪДИХЫВХСГДТЯЫВХСДЬГТХСИЫГТГЪИБИДСУЯЮЫОЬХОЖБИПУСБЯТЖИЫСОКОХОЫООЬХОЖСНЫОЪИБВПУСУИОЯУЛФОДОАБВЕИАИХЯГТНТУЛШУИЫСЩЬАЛИЯИЩОЫЫИФДСЮУЫИОГДИХОУИЪИИЫЩВЖДТЯЯОЮЫБЯУТБТЮИЫБХОЯУИЯБИОПРЖЮФВНТЕБТУСЖУДОЬЪИЖЛЫЬЭРЖЮФЬЯЪОЫОДТЖЛЯГСХФЖЭХТЗОХСАОДЗТЖООАОДЪТЮЯЬЖУТЫАИУОЕФИДФИГТЪОЫОДТЖЫОФИФДИЯСЖБИНБДТУСУЛООЫИБЯЮОЪИДТЯЯОЮЫЫИЯУЛСЫОЬХОЫЛОБИПУСБЯТЖИЫСЪИБИДСУЛБЫОХБВГЬФТЖСЯЛБВДТЗОЫСОХАИЩДИАЬРСЮФДИЯУИУВСЯГДИХЫИЯУСТЫЫТФТБЖИБЫТФИБОДЫЬЖТЯЛГЫОХЬСЯЕДСЯУСТЫЯГИЭГДИУИЯУЛЭБВДТЗТЮФДИКОЫСОНТОЪИБВЕИАГЬГСБЫЬЖТОХЬСЯГТНТЖТ'
cipher_text = 'ЛТЬНЩЭЦДЦЧЫЩЧДЦВЧСЙРЪАЪЮЫДЙНИЪЗКДРЦПСЫГДЩТПНВЪЬСЦСПУЕСВНИДВЦЫЩЧДЦЛНРЙТАДРЦТЩЭРНЯОСЙШСЦСЫЬНВОДКЪТЩЪВЦСЫВЫУВФЪАСГПТЮСЫТРЪДАЫСГЩТВЦЪОПЪЬЩТЙРСЕАТЦДАТЦЪЬЪЪЪРЛСПАТЦЪЬЪСГНХДРЪДРТЛТЬНЩЭЦДЦДСВНИДВЦЫЩЧДЦВЧЬТЬЫПТАЬТЗОДПЫСЕВЦНОДРЪЫУВФДШССГПТЮСЫТРЪЧЦТЬЪЫЦСПСЕАТШЪВЦПТЦНПТЫТВОЪПТРЦНПДЪЙСЬЦСПТРЦНПДЫДЙДЦВЧОСЙШСЦСЫЬТРТНХРУЗЪРТНХРСОДЙТШСШЪХДВЬЪЗПТГСЦРЪЬСЫЫУВФДЕЬЫТЩЪЛЪЬТКЪЪЬПСАДЦСШСРТЛТЬНЩЭЦДЦДВНИДВЦЫНДЦВЪВЦДАТОДПДОСЙШСЦСЫЬЪЬТЙПСЫЪОСЫУФДРЪЧЪАЪВЫСДЕОПСЛДВВЪСРТЩЭРСЕЬЫТЩЪЛЪЬТКЪЪЪВЪВЦДАТЙСЫНЮСЫВЬСЕОСЙШСЦСЫЬЪФЬСЩЭРЪЬСЫЫУОНВЬРЪЬЪЛТЬНЩЭЦДЦТОСЩНХТЯЦЬЫТЩЪЛЪЬТКЪЯЫВССЦЫДЦВЦЫЪЪВОПСЛЪЩДАВОДКЪТЩЭРСВЦЪОСЮЫСЩЧЯИНЯЪАЮТРЪАТЦЭВЧРТНХРСЪВВЩДЙСЫТЦДЩЭВЬСЕОПСГЩДАРСТРТЩЪЦЪХДВЬСЕЪСПШТРЪЮТКЪСРРСНОПТЫЩДРХДВЬСЕЙДЧЦДЩЭРСВЦЭЯРТОДПЫСАЪЫЦСПСАЬНПВТЗЙЩЧВЦНЙДРЦСЫЫВДЗВОДКЪТЩЭРСВЦДЕОПДОСЙТЯЦВЧГТЮСЫУДСГИДАТЦДАТЦЪХДВЬЪДЪСГИДОПСШПТААЪВЦВЬЪДЙЪВКЪОЩЪРУАТЦДАТЦЪХДВЬЪЕТРТЩЪЮШДСАДЦПЪЧЪТЩШДГПТЙЪЛЛДПДРКЪТЩЭРУДНПТЫРДРЪЧЙЪВЬПДЦРТЧАТЦДАТЦЪЬТЪАТЦДАТЦЪХДВЬТЧЩСШЪЬТОПСШПТААЪПСЫТРЪДСОДПТКЪСРРУДВЪВЦДАУВОДКЪТЩЪЮТКЪЧВЦНЙДРЦСЫЛТЬНЩЭЦДЦТОПЪЬЩТЙРСЕАТЦДАТЦЪЬЪЪЪРЛСПАТЦЪЬЪЫПТАЬТЗЪЮГПТРРСЕВОДКЪТЩЭРСВЦЪСВНИДВЦЫЩЧДЦВЧРТХЪРТЧВЦПДЦЭДШСЬНПВТСГНХДРЪЧ'
alphabet = list('АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ')

alphabet_frequency_1 = list('ОЕАИНТСРВЛКМДПУЯЫЬГЗБЧЙХЖШЮЦЩЭФЪ')
alphabet_frequency_2 = list('ОЕАИТНСРВЛКМДПУЯЫЬГЗБЧЙХЖШЮЦЩЭФЪ')
alphabet_frequency_3 = list('ОЕАИТНСРВЛКПМУДЯЫЬЗБГЙЧЮХЖШЦЩФЭЪ')
alphabet_frequency_4 = list('ОАЕИНТРСЛВКПМУДЯЫЬЗБГЙЧЮХЖШЦЩФЭЪ')
alphabet_frequency_5 = list('ЕОАИНТСЛРВКМДПУЯЫЬЗГБЧЙЖХШЮЭЩЦФЪ')
alphabet_frequency_6 = list('ЕОАИ....РВК....ЯЫЬ..............')
alphabet_frequency_X = list('ЕО..............................')

print(cipher_text)
attack_1 = FreqAttack(alphabet, alphabet_frequency_1)
print(attack_1.executeAttack(cipher_text))

print('---------------', attack_1.cipher_frequency, '------------------')

attack_2 = FreqAttack(alphabet, alphabet_frequency_2)
print(attack_2.executeAttack(cipher_text))
attack_3 = FreqAttack(alphabet, alphabet_frequency_3)
print(attack_3.executeAttack(cipher_text))
attack_4 = FreqAttack(alphabet, alphabet_frequency_4)
print(attack_4.executeAttack(cipher_text))
attack_5 = FreqAttack(alphabet, alphabet_frequency_5)
print(attack_5.executeAttack(cipher_text))
attack_6 = FreqAttack(alphabet, alphabet_frequency_6)
print(attack_6.executeAttack(cipher_text))

# 1-ый Толкиен, война и мир, ФПМИ текст